MusicApp/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."email" = $2 LIMIT $3  [["username", "ben@gmail.com"], ["email", "ben"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, email, password)
    user = User.find_by(username: username, email: email)